<template>
  {{ orders }}
</template>

<script setup>
/**
 * Пользователю нужно найти подходящие ему заказы.
 * Для этого нужно сделать фильтр из двух полей, где пользователь может задать диапазон стоимости заказа От и До.
 *
 * Отфильтрованные заказы следует выводить в таблице ниже фильтра, с двумя столбцами по составу данных заказов.
 * Реализовать так же мобильный вид (320px), где таблица будет заменена на карточки.
 *
 * См. макеты в папке design
 */
// Список заказов
const orders = [
  {name: "Заказ 1", org: 'ООО "АвтоАгрегат"', status: 'Новый', price: 0, date: '2022-04-22 13:56:34'},
  {name: "Заказ 2", org: 'ООО "Силовые машины"', status: 'Завершен', price: 500, date: '2022-05-30 15:23:43'},
  {name: "Заказ 3", org: 'ООО "Автотранспортное предприятие №1"', status: 'В обработке', price: 100, date: '2022-02-12 22:45:23'},
  {name: "Заказ 4", org: 'Байкал Сервис', status: 'Новый', price: null, date: '2022-06-22 13:56:34'},
  {name: "Заказ 5", org: 'ООО "Энергия"', status: 'В обработке', price: 50, date: '2022-07-12 14:34:34'},
  {name: "Заказ 6", org: 'ЗАО "МегаТранс"', status: 'Завершен', price: 200, date: '2022-08-17 16:56:34'},
  {name: "Заказ 7", org: 'ООО "Техмаш"', status: 'В обработке', price: 56, date: '2022-09-15 15:25:34'},
  {name: "Заказ 8", org: 'АО "Автодор"', status: 'Новый', price: null, date: '2022-04-22 14:12:56'},
];
</script>

<style scoped>

</style>
